Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: You can extend a generic type to conditionally conform to a protocol, so that instances of the type conform to the protocol only when certain requirements are met.
ja: あなたは、条件付きでプロトコルに準拠するように総称体型を拡張できます、それでその型のインスタンスは特定の要件が満たされた場合にのみそのプロトコルに準拠します。

source: You can extend an existing type to add conformance to a protocol, as described in Adding Protocol Conformance with an Extension.
ja: あなたは、拡張を使ってプロトコル準拠を加えるで記述されるように、既存の型を拡張することでプロトコルへの準拠を加えることができます。

source: You can extend an existing type to adopt and conform to a new protocol, even if you don’t have access to the source code for the existing type.
ja: あなたは、ある新しいプロトコルを採用して準拠することで既存の型を拡張することができます、たとえあなたが既存の型のソース・コードにアクセスをしないとしてもです。

source: You can extend the Rect structure to provide an additional initializer that takes a specific center point and size:
ja: あなたは、Rect構造体を拡張して、特定の中心点と大きさをとる追加のイニシャライザを提供することができます：

source: You can extend the behavior of a class type with an extension declaration, as discussed in Extension Declaration.
ja: あなたはクラス型の挙動を拡張宣言を使って拡張することができます、拡張宣言で議論されるように。

source: You can extend the behavior of a structure type with an extension declaration, as discussed in Extension Declaration.
ja: あなたは構造体型の挙動を拡張宣言を使って拡張することができます、拡張宣言で議論されるように。

source: You can extend the behavior of an enumeration type with an extension declaration, as discussed in Extension Declaration.
ja: あなたは列挙型の挙動を拡張宣言を使って拡張することができます、拡張宣言で議論されるように。

source: You can fit two 4s inside 9, and the remainder is 1 (shown in orange).
ja: あなたは２つの4を9の内部に収めることができます、そして余りは1です（オレンジ色で示されます）。

source: You can give a setter a lower access level than its corresponding getter, to restrict the read-write scope of that variable, property, or subscript.
ja: あなたは、セッターにその対応するゲッターよりもより低いアクセス水準を与えて、その変数、プロパティ、または添え字の読み書きのスコープを制限することができます。

source: You can implement a protocol initializer requirement on a conforming class as either a designated initializer or a convenience initializer.
ja: あなたは、イニシャライザ要件プロトコルを準拠クラス上で指定イニシャライザまたは便宜イニシャライザとして実装することができます。

source: You can include a generic where clause on an associated type.
ja: あなたは、総称体where節を関連型に関して含めることができます。

source: You can include additional spaces and tabs after that indentation; those spaces and tabs appear in the string.
ja: あなたは、追加の空白とタブをその字下げの後に含めることができます；それらの空白とタブは文字列の中に現れます。

source: You can include as many optional bindings and Boolean conditions in a single if statement as you need to, separated by commas.
ja: あなたは、単一のif文の中に、コンマで区切ったオプショナル束縛とブール条件をあなたが必要とするだけ多く含めることができます。

source: You can include labels in a dynamic method call if you implement the dynamicallyCall(withKeywordArguments:) method.
ja: あなたは、いくつかのラベルを動的メソッド呼び出しに含めることができます、もしあなたがdynamicallyCall(withKeywordArguments:)メソッドを実装するならば。

source: You can include multiple requirements in a generic where clause that is part of an extension, just like you can for a generic where clause that you write elsewhere.
ja: あなたは、複数の要件を拡張の一部であるひとつのwhere節の中に含めることができます、ちょうどあなたがどこか他で書く総称体where節に対してできるように。

source: You can include predefined String values within your code as string literals.
ja: あなたは、あらかじめ定義されたString値を文字列リテラルとしてあなたのコードの内部に含めることができます。

source: You can initialize the Rect structure below in one of three ways—by using its default zero-initialized origin and size property values, by providing a specific origin point and size, or by providing a specific center point and size.
ja: あなたは、以下のRect構造体を３つの方法のうちの１つで初期化することができます ― それの省略時の０で初期化されたoriginとsizeプロパティ値を使うことによって、特定の原点とサイズを提供することによって、または特定の中心点とサイズを提供することによって。

source: You can iterate over the entire set of values in an array with the for-in loop:
ja: あなたは、for-inループを使って配列中の値ひとそろい全部に渡って繰り返すことができます：

source: You can iterate over the key-value pairs in a dictionary with a for-in loop.
ja: あなたは、for-inループを使って、ある辞書の中の「キーと値」のすべてに対して操作を繰り返し適用していくことができます。

source: You can iterate over the string with a for-in statement, to access its individual Character values as Unicode extended grapheme clusters.
ja: あなたは文字列の全体にわたってfor-in文を使って繰り返すことができます、それでユニコードの拡張書記素クラスタとしてのそれの個々のCharacter値にアクセスします。

source: You can iterate over the values in a set with a for-in loop.
ja: あなたは集合の中の値すべてに渡って繰り返しすることがfor-inループによって行えます。

source: You can keep an index in a loop by using ..< to make a range of indexes.
ja: あなたは、インデックス（索引）をループにおいて保持することが、..<を使ってインデックスの範囲を作ることで可能です。

source: You can limit protocol adoption to class types (and not structures or enumerations) by adding the AnyObject protocol to a protocol’s inheritance list.
ja: あなたは、プロトコル採用をクラス型に制限する（つまり構造体や列挙で採用しない）ことがAnyObjectプロトコルをプロトコルのもつ継承リストに加えることによって可能です。

source: You can link together multiple levels of optional chaining to drill down to properties, methods, and subscripts deeper within a model.
ja: あなたは、オプショナル連鎖の複数の階層を結びつけて、あるモデル内のより深いプロパティ、メソッド、そして添え字に掘り下げていくことができます。

source: You can list as many protocols as you need, separating them with ampersands (&).
ja: あなたは、あなたが必要とするだけ多くのプロトコルを、それらをアンパサンド（&）で隔てて列記できます。

source: You can make a generic type conditionally conform to a protocol by listing constraints when extending the type.
ja: あなたは、ある総称体型を条件付きでプロトコルに準拠させることが、その型を拡張する時に制約を列記することによって可能です。

source: You can make generic forms of functions and methods, as well as classes, enumerations, and structures.
ja: あなたは関数やメソッドだけでなく、クラス、列挙、そして構造体も総称体の形式にすることができます。

source: You can make the structure’s numberOfEdits property getter public, and its property setter private, by combining the public and private(set) access-level modifiers:
ja: あなたは、この構造体のnumberOfEditsプロパティゲッターを公開に、そしてそれのプロパティセッターを非公開にすることが、publicとprivate(set)アクセス水準修飾子を組み合わせることによって可能です。

source: You can mark a declaration with one of the access-level modifiers below to specify the declaration’s access level.
ja: あなたは、宣言を以下のアクセス水準修飾子のうちの１つで印して、その宣言のアクセス水準を指定することができます。

source: You can mark an entire class as final by writing the final modifier before the class keyword in its class definition (final class).
ja: あなたは、そのクラス定義においてclassキーワードの前にfinal修飾子を書くことによって（final class）、そのクラス全体を最終版として印することができます。

source: You can mark designated and convenience initializers with the required declaration modifier to require that every subclass implement the initializer.
ja: あなたは指定および便宜イニシャライザをrequired宣言修飾子で印して、全てのサブクラスがそのイニシャライザを実装することが必須であるようにすることができます。

source: You can match individual enumeration values with a switch statement:
ja: あなたは、switch文を使って個々の列挙値を照合することができます：

source: You can mix and match components of key paths to access values that are deeply nested within a type.
ja: あなたは、キーパスの構成要素をうまく組み合わせることで、ある型の内部に深く入れ子にされた値にアクセスできます。

source: You can name the individual elements in a tuple when the tuple is defined:
ja: あなたは、タプルの個々の要素に名前をつけることが、そのタプルが定義される時に可能です：

source: You can name the parameter or use the default parameter name of oldValue.
ja: あなたはパラメータに名をつけること、または省略時のパラメータ名のoldValueを使うことが出来ます。

source: You can nest labeled statements, but the name of each statement label must be unique.
ja: あなたはラベルをつけられた文を入れ子にすることができます、しかし、各文ラベルの名前は特有でなければなりません。

source: You can now call the assigned function with the name mathFunction:
ja: あなたは、今や、代入された関数を名前mathFunctionを使って呼ぶことができます：

source: You can now create a Customer instance, and use it to initialize and assign a new CreditCard instance as that customer’s card property:
ja: あなたは、現在Customerインスタンスを作成して、それを使って、新しいCreditCardインスタンスを、その顧客のcardプロパティとして初期化して代入することができます：

source: You can now create a new Person instance and assign it to one of these three variables:
ja: あなたは、いま新しいPersonインスタンスを作成して、それをこれらの３つの変数のうちの１つに代入することができます：

source: You can now create a specific Person instance and Apartment instance and assign these new instances to the john and unit4A variables:
ja: あなたは、今や特定のPersonインスタンスとApartmentインスタンスを作成して、それらの新しいインスタンスをjohnおよびunit4A変数に代入することができます：

source: You can now link the two instances together so that the person has an apartment, and the apartment has a tenant.
ja: あなたは次に人がアパートを持つように、２つのインスタンスを結びつけることができます、するとアパートには賃借人があります。

source: You can now try to set a property’s value, assign to a subscript, or call a mutating method or operator through Optional Chaining.
ja: あなたは今ではオプショナル連鎖を通して、プロパティの値を設定する、ある添え字に代入する、または変更メソッドまたは演算子を呼び出すことを試みることが出来ます。

source: You can now use chooseStepFunction(backward:) to obtain a function that will step in one direction or the other:
ja: 現在あなたはchooseStepFunction(backward:)を使って、ある方向にまたはもう一方に進む関数を取得できます：

source: You can now use the numbers array to create an array of String values, by passing a closure expression to the array’s map(_:) method as a trailing closure:
ja: あなたは、現在、このnumbers配列をString値の配列をつくるために使うことが、あるクロージャ式を配列のmap(_:)メソッドに後付クロージャとして渡すことによって、可能です：

source: You can now use this operator to check whether two Vector2D instances are equivalent:
ja: あなたは、今ではこの演算子を使って２つのVector2Dインスタンスが等しいかどうか調べられます：

source: You can omit either property or both properties, and the initializer uses the default value for anything you omit—for example:
ja: あなたは、どちらかのプロパティまたは両方のプロパティを省略できます、そしてイニシャライザは省略時の値をあなたが省略するどんなものにも使います — 例えば：

source: You can omit the assertion message—for example, when it would just repeat the condition as prose.
ja: あなたは表明メッセージを省略できます — 例えば、それが単に条件を単調に繰り返す場合。

source: You can only call a dynamically callable instance with arguments and a return value that match the types you specify in one of your dynamicallyCall method implementations.
ja: あなたは動的callableインスタンスを、あなたのdynamicallyCallメソッド実装の１つにおいてあなたが指定する型に合致する引数いくつかと戻り値ひとつで呼び出せるだけです。

source: You can only pass a variable as the argument for an in-out parameter.
ja: あなたは、in-outパラメータに対する引数として、変数を渡すことだけができます。

source: You can opt in to this behavior by placing the mutating keyword before the func keyword for that method:
ja: あなたは、そのメソッドのためのfuncキーワードの前にmutatingキーワードを置くことによってこの挙動を取り入れることができます：

source: You can opt in to value overflow behavior by using Swift’s overflow operators (such as a &+ b).
ja: あなたは、スウィフトのオーバフロー演算子を使用することによって、値オーバフロー挙動を選ぶことが可能です（例えばa &+ bのように）。

source: You can opt in to value overflow behavior by using Swift’s overflow operators, as described in Overflow Operators.
ja: オーバフロー演算子で記述されるように、あなたは、スウィフトのもつオーバフロー演算子を使うことによって、値オーバフロー挙動を選ぶことが可能です。

source: You can overload a generic function or initializer by providing different constraints, requirements, or both on the type parameters.
ja: あなたは、総称体の関数やイニシャライザをオーバーロードすることが、異なる制約、要件、または両方を型パラメータ上で提供することによって可能です。

source: You can overload a subscript declaration in the type in which it is declared, as long as the parameters or the return type differ from the one you’re overloading.
ja: あなたは、ある添え字宣言を、そこにおいてそれが宣言される型においてオーバーロードすることができます、パラメーターまたは戻り型があなたがオーバーロードしているものと異なる限りはです。

source: You can overload the ~= operator to provide custom expression matching behavior.
ja: あなたは、~=演算子をオーバーロードして、あつらえの式マッチング挙動を提供することができます。

source: You can override a failable initializer with a nonfailable initializer but not the other way around.
ja: あなたは失敗できるイニシャライザを、失敗できないイニシャライザでオーバーライドできます、しかし逆はできません。

source: You can override a nonreturning method, but the new method must preserve its return type and nonreturning behavior.
ja: あなたは非復帰メソッドをオーバーライドすることができます、しかし新しいメソッドはそれの戻り型と非復帰挙動を維持しなければなりません。

source: You can override a property in a subclass by marking the subclass’s property declaration with the override declaration modifier, as described in Overriding.
ja: あなたは、オーバーライドで記述されるように、サブクラスのプロパティ宣言をoverride宣言修飾子で印することによってサブクラスの中のプロパティをオーバーライドすることができます。

source: You can override a superclass failable initializer in a subclass, just like any other initializer.
ja: あなたは、スーパークラスの失敗できるイニシャライザをサブクラスにおいてオーバーライドすることが、何らかの他のイニシャライザとまったく同じようにできます。

source: You can override an inherited instance or type method to provide a tailored or alternative implementation of the method within your subclass.
ja: あなたは、ある継承されたインスタンスまたは型メソッドをオーバーライドすることで、あなたのサブクラス内部でそのメソッドの特注のまたは代替の実装を提供することができます。

source: You can override an inherited instance or type property to provide your own custom getter and setter for that property, or to add property observers to enable the overriding property to observe when the underlying property value changes.
ja: あなたは継承されたインスタンスまたは型プロパティをオーバーライドして、そのプロパティのためにあなた独自のあつらえのゲッターとセッターを用意したり、根底にあるプロパティ値がいつ変化するか監視することをオーバーライドしているプロパティに可能にするプロパティオブザーバーを加えることができます。

source: You can override the default behavior for argument labels with one of the following forms:
ja: あなたは引数ラベルに対する初期状態の挙動をオーバーライドすることが以下の形式の１つで可能です：

source: You can override this default behavior by marking the declaration with an access-level modifier, as described in Access Control Levels.
ja: あなたは、アクセス制御ラベルで記述されるように、この初期状態のふるまいをその宣言をアクセス水準修飾子で印することによってオーバーライドすることができます。

source: You can pass a value of any conforming type in to this parameter when initializing a new Dice instance.
ja: 新しいDiceインスタンスを初期化するとき、あなたはどんな準拠型の値でもこのパラメータに渡すことができます。

source: You can pass any function of that type as the argument for this first parameter.
ja: あなたは、この最初のパラメータに対する引数として、その型のどんな関数でも渡すことができます。

source: You can place a string literal within extended delimiters to include special characters in a string without invoking their effect.
ja: あなたは、文字列リテラルを拡張区切り記号内に置くことで、いくらかの特殊文字を文字列の中にそれらの効果を発動することなしに含めることができます。

source: You can prefix a loop statement, an if statement, a switch statement, or a do statement with a statement label, which consists of the name of the label followed immediately by a colon (:).
ja: あなたはループ文、if文、switch文、またはdo文の前に文ラベルを置くことができます、それは、ラベルの名前とそれに直ちに続くコロン（:）から成ります。

source: You can present an inherited read-only property as a read-write property by providing both a getter and a setter in your subclass property override.
ja: あなたのサブクラスプロパティオーバーライドにおいてゲッターとセッターの両方を提供することによって、あなたは継承された読み出し専用のプロパティを、読み書き両用のプロパティとして提供することができます。

source: You can prevent a method, property, or subscript from being overridden by marking it as final.
ja: あなたはメソッド、プロパティ、または添え字がオーバーライドされるのを、それを最終版（final）と印することによって妨げることができます。

source: You can print the current value of a constant or variable with the print(_:separator:terminator:) function:
ja: あなたは、print(_:separator:terminator:)関数で定数または変数の現在の値を出力することができます：

source: You can propagate the error from a function to the code that calls that function, handle the error using a do-catch statement, handle the error as an optional value, or assert that the error will not occur.
ja: あなたは、エラーを関数からその関数を呼び出しているコードに伝えて、そのエラーをdo-catch文を使って取り扱う、エラーをオプショナルとして取り扱う、またはそのエラーは起こらないことを表明することができます。

source: You can provide initialization parameters as part of an initializer’s definition, to define the types and names of values that customize the initialization process.
ja: あなたは、イニシャライザの定義の一部として初期化パラメータを提供することができます、それによって初期化処理をカスタマイズする値の型と名前を定義します。

source: You can provide a type annotation when you declare a constant or variable, to be clear about the kind of values the constant or variable can store.
ja: あなたは、あなたが定数または変数を宣言するとき、その定数または変数が格納することができる値の種類について明確にするために、型注釈を提供することができます。

source: You can provide a custom getter (and setter, if appropriate) to override any inherited property, regardless of whether the inherited property is implemented as a stored or computed property at source.
ja: あなたは、あつらえのゲッターを（そして適切ならば、セッターも）提供することで、あらゆる継承されたプロパティをオーバーライドできます、継承されたプロパティがその発生源で格納プロパティもしくは計算プロパティとして実装されるかは関係しません。

source: You can provide a default value for a stored property as part of its definition, as described in Default Property Values.
ja: 省略時のプロパティ値で記述されるように、あなたは格納プロパティのために省略時の値をその定義の一部として用意することができます。

source: You can provide an explicit name in parentheses after set.
ja: あなたは、setの後に括弧の中ではっきりとした名前を提供することができます。

source: You can provide more than one type parameter by writing multiple type parameter names within the angle brackets, separated by commas.
ja: あなたは、山形括弧内に複数の型パラメータ名をコンマで区切って書くことによって、複数の型パラメータを提供することができます。

source: You can provide multiple catch blocks that handle specific errors.
ja: あなたは、それぞれが特定のエラーを取り扱う複数のcatchブロックを提供することができます。

source: You can provide whatever arguments you need to the attribute, and they’re passed to the initializer.
ja: あなたは、どんなものでもあなたが必要とする引数それらを属性に提供できます、そしてそれらはイニシャライザに渡されます。

source: You can put parentheses around a named type or a compound type.
ja: あなたは、名前付きの型や複合の型の周りに丸括弧を置くことができます。

source: You can query the threeTimesTable instance by calling its subscript, as shown in the call to threeTimesTable[6].
ja: あなたは、threeTimesTableインスタンスにその添え字を呼ぶことによって問い合わせることがthreeTimesTable[6]への呼び出しで示されるように可能です。

source: You can read this code as:
ja: あなたは、このコードを次のように読むことができます：

source: You can refer to parameters by number instead of by name—this approach is especially useful in very short closures.
ja: あなたは、名前によってでなく、数によってパラメータに言及することができます ― この取り組み方は、特に非常に短いクロージャで役立ちます。

source: You can remove an item from a set by calling the set’s remove(_:) method, which removes the item if it’s a member of the set, and returns the removed value, or returns nil if the set did not contain it.
ja: あなたはある項目を集合から取り除くことが集合のremove(_:)メソッドを呼ぶことによって行えます、それは、その項目をそれが集合のメンバーであるならば取り除きます、そして取り除かれた項目を返します、または集合がそれを含まないならばnilを返します。

source: You can revise the SurveyQuestion example from above to use a constant property rather than a variable property for the text property of the question, to indicate that the question does not change once an instance of SurveyQuestion is created.
ja: あなたは、上記のSurveyQuestion例を、変数プロパティではなく定数プロパティを質問のtextプロパティのために使うように見直して、その質問は一旦SurveyQuestionのインスタンスが作成されるならば変化しないことを示すことができます。

source: You can rewrite the TemperatureUnit example from above to use raw values of type Character and to take advantage of the init?(rawValue:) initializer:
ja: あなたは、上のTemperatureUnit例をCharacter型の生の値を使うように、そしてinit?(rawValue:)イニシャライザを活用するように書き直すことができます：

source: You can rewrite the chooseStepFunction(backward:) example above to use and return nested functions:
ja: あなたは、入れ子にされた関数を使用して返すように、上記のchooseStepFunction(backward:)の例を書き直すことができます：

source: You can rewrite the possibleNumber example from the Optionals section to use optional binding rather than forced unwrapping:
ja: あなたはオプショナル節のpossibleNumber例を、強制アンラップではなくて、オプショナル束縛を使うように書き直すことができます：

source: You can see a similar problem by thinking about how you update a budget that’s written on a piece of paper.
ja: あなたは、一片の紙に書かれる予算案を更新する方法について考えることによって、同種の問題を調べられます。

source: You can set a constant or variable to Planet.earth, and check for this value later.
ja: あなたは、定数または変数をPlanet.earthに設定することができて、後でその値について調べることができます。

source: You can set a value in a dictionary by providing a key of the dictionary’s key type within subscript brackets, and assigning a value of the dictionary’s value type to the subscript:
ja: あなたは、添え字角括弧内にその辞書のキー型のキーを提供し、そしてその添え字に辞書の値型の値を代入することによって、値を辞書に設定することができます：

source: You can set an initial value for a stored property within an initializer, or by assigning a default property value as part of the property’s definition.
ja: あなたは、イニシャライザの内部で、またはそのプロパティの定義の一部として省略時のプロパティの値を代入することによって、格納プロパティのために初期値を設定することができます。

source: You can set the hasBasket property to true for a particular Bicycle instance after that instance is created:
ja: あなたは、特定のBicycleインスタンスに対してhasBasketプロパティをtrueに設定することが、そのインスタンスを作成した後で行えます：

source: You can set the initial value of a stored property from within an initializer, as shown above.
ja: あなたはイニシャライザ内から格納プロパティの初期値を設定することが、上で示されるように、行えます。

source: You can simplify the declaration of a read-only computed property by removing the get keyword and its braces:
ja: あなたは、読み出し専用の計算プロパティの宣言をgetキーワードとそれの波括弧を取り除くことによって単純化することができます：

source: You can specify a name for this parameter as part of your willSet implementation.
ja: あなたは、あなたのwillSet実装の一部としてこのパラメータに名前を指定することができます。

source: You can specify a type annotation for these patterns to constrain them to match only values of a certain type.
ja: あなたは型注釈をこれらのパターンに指定して、それらがある特定の型の値だけにマッチするように制約を加えることができます。

source: You can specify additional requirements on type parameters and their associated types by including a generic where clause right before the opening curly brace of a type or function’s body.
ja: あなたは、追加の要件を型パラメータおよびそれの関連型に指定することが総称体where節を型または関数の本文の開き波括弧のまさに前に含めることによって行えます。

source: You can subclass any class that can be accessed in the current access context and that’s defined in the same module as the subclass.
ja: あなたは、現在のアクセス前後関係においてアクセスされることが出来るどんなクラスにでもサブクラスを作れます、それは同じモジュールの中でサブクラスとして定義されます。

source: You can tell that the createAddress() function isn’t called, because nothing is printed.
ja: あなたは、createAddress()関数が呼ばれなかったと言うことができます、なぜなら何も出力されなかったからです。

source: You can then create new barcodes using either type:
ja: あなたはそれから新しいバーコードをどちらかの型を使って作成できます：

source: You can therefore call the allItemsMatch(_:_:) function with these two containers as its arguments.
ja: あなたは、したがって、allItemsMatch(_:_:)関数をその引数としてこれらの２つのコンテナを使って呼ぶことができます。

source: You can think of an implicitly unwrapped optional as giving permission for the optional to be force-unwrapped if needed.
ja: あなたは暗黙的にアンラップされるオプショナルを、必要に応じて強制アンラップされる許可をそのオプショナルに与えていると考えることができます。

source: You can think of an opaque type like being the reverse of a generic type.
ja: あなたは、不透明型を総称体の逆であるように考えることができます。

source: You can think of the associated values as behaving like stored properties of the enumeration case instance.
ja: あなたはそれら関連値を、その列挙ケース節インスタンスに属する格納プロパティのように振る舞うものとして考えることができます。

source: You can use if and let together to work with values that might be missing.
ja: あなたは、ifとletを一緒に使って、見つからないかもしれない値を扱うことができます。

source: You can use defer to write setup and cleanup code next to each other, even though they need to be executed at different times.
ja: あなたは、deferを使うことでセットアップおよびクリーンアップコードを隣り合わせに書くことができます、たとえそれらが異なる時に実行される必要があるにしても。

source: You can use allCases like any other collection—the collection’s elements are instances of the enumeration type, so in this case they’re Beverage values.
ja: あなたは、allCasesを何らかの他のコレクションと同様に使うことができます — コレクションの持つ要素は列挙型のインスタンスです、それでこの場合においてそれらはBeverage値です。

source: You can use Xcode 11.4 to build targets that are written in either Swift 5.2, Swift 4.2, or Swift 4.
ja: あなたは、Xcode 11.4を使ってSwift 5.2、Swift 4.2、またはSwift 4のいずれかで書かれたターゲットをビルドできます。

source: You can use a defer statement even when no error handling code is involved.
ja: あなたは、defer文を使うことが、エラー処理コードを伴わない時でさえも可能です。

source: You can use a capture list to explicitly control how values are captured in a closure.
ja: あなたはキャプチャリストを使って、どのようにあるクロージャにおいて値がキャプチャされるかを明示的に制御します。

source: You can use a failable initializer to select an appropriate enumeration case based on one or more parameters.
ja: あなたは、失敗できるイニシャライザを使って適切な列挙ケース節を１つ以上のパラメータに基づいて選ぶことができます。

source: You can use a function type as the return type of another function.
ja: あなたは、ある関数型をそれとは違う関数の戻り型として使うことができます。

source: You can use a function type such as (Int, Int) -> Int as a parameter type for another function.
ja: あなたは、ある関数型、例えば(Int, Int) -> Intを、別の関数のためのパラメータ型として使うことができます。

source: You can use a generic where clause with extensions to a protocol.
ja: あなたは、総称体where節をプロトコルに対する拡張で使うことができます。

source: You can use a key path expression in contexts where you would normally provide a function or closure.
ja: あなたはキーパス式を、あなたが通常は関数またはクロージャを提供するところの文脈において使用できます。

source: You can use a protocol in many places where other types are allowed, including:
ja: あなたは、プロトコルを、他の型が許可される多くの場所で使用できます、以下を含みます：

source: You can use a protocol name just like any other named type—for example, to create a collection of objects that have different types but that all conform to a single protocol.
ja: あなたは、何かほかの名前付きの型のようにプロトコル名を使用することができます ― 例えば、それぞれ異なる型を持つが全てがただ１つのプロトコルに準拠するオブジェクトいくつかのコレクションをつくるためなど。

source: You can use a set instead of an array when the order of items is not important, or when you need to ensure that an item only appears once.
ja: あなたは、項目の順番が重要でないときに、またはあなたがひとつの項目がただ一度だけ現れることを確実にする必要があるときに、配列の代わりに集合を使うことができます。

source: You can use a tuple to return multiple values from a function as a single compound value.
ja: あなたはタプルを使って、関数から複数の値を１つの混成値として返すことができます。
